P = '\\p'
M = {
"4828D4":"היריב מותקף במכת קראטה חדה. סיכוי גבוה למכה קריטית.",
"4829E5":"הרבה מטבעות נזרקים על היריב. מרוויחים כסף אחרי הקרב.",
"482A29":"היריב חוטף אגרוף בוער. הוא עלול להיכוות.",
"482DF6":"היריב מוכה בגפנים דקים דמויי שוט.",
"482F6A":"הרבה חול נזרק לפני היריב ומוריד את הדיוק שלו.",
"483074":"הקרן מסתובבת כמו מקדחה להתנגחות. היריב מתעלף אם היא פוגעת.",
"4830BC":"התקפה פיזית שבה המשתמש מסתער בכל הגוף על היריב.",
"483102":"המשתמש מפיל את כל גופו על היריב. הוא עלול להשתתק.",
"483622":"היריב נצרב בלהבות עזות. הוא עלול להיכוות.",
"483CFB":"אבק מרדים מתפזר בכמות גדולה סביב היריב.",
"484625":"חומת אור מקטינה נזק מהתקפות מיוחדות לחמישה תורות.",
"487E90":"המשתמש סופג כוח מיסטי כדי להעלות הגנה והגנה מיוחדת.",
"4882C6":"היריב נפגע מענף ענק. המשתמש לא יכול לזוז בתור הבא.",
"488314":"המשתמש מנפח את גופו כדי להגביר גם התקפה וגם הגנה.",
}
for k, v in M.items(): d[k] = '~126~' + v
d.update({
"3FD66F": "היה יבש מדי!",
"3FD67C": "היה מתוק מדי!",
"3FD68B": "היה מר מדי!",
"3FD69B": "היה חמוץ מדי!",
"4580E8": "~רצית לפטפט? בסדר, אבל בבקשה חכה רגע.",
"4584DC": "אם אתה רוצה להילחם, אתה צריך שני פוקימונים מתחת לרמה 30." + P,
"458BA4": "לוח ההחלפות הזה משמש להצעת פוקימון להחלפה." + P + "כל מה שצריך זה לרשום פוקימון להחלפה." + P + "מאמן אחר עשוי להציע פוקימון מהצוות שלו בתמורה." + P + "אנחנו מקווים שתרשום פוקימונים ותחליף אותם עם הרבה הרבה מאמנים אחרים." + P + "תרצה לרשום אחד מהפוקימונים שלך?",
"4594FC": "זה כרטיס זהב!",
})
